getEndUserElementsWithGivenType(ADocument*,ElementId,ElementId,DBView*,Arr&lt;ElementId&gt;*)
Return in pIdArr all elements that have typeId as their type (as defined by what shows up in the Type Selector).
If optionId is valid, find only the elements in the specified Design Option; otherwise (default), find all.
If pDBView is set, find only in the elements of the DBView; otherwise (default), find in the entire model.
Exclude elements not meaningful to the end user:
a) Exclude elements in sketches and families.
b) Exclude invisible stuff like symbols, surrogates, and invisible balusters.
c) Exclude anything in a Legend View.
d) Exclude anything that is filtered out by box-selection filter chain.
Return the number found.